Pandas is an open source. It is BSD licensed library which provides us with high performance, ease in using data structures and data analysis tools.

## 14.2 Slicing Dataframe

# Exercise 1 - Laod .csv dataframe, read dataframe, create new dataframe from dataframe, create series from dataframe

### 1. import required packages

In [2]:
import pandas as pd

### 2. load csv as dataframe

In [6]:
df = pd.read_csv('C:\\Users\\rs\\Downloads\\01 Data Science Lab Copy\\02 Lab Data\\Python\\pandas_sales.csv', index_col = 'month')

In [7]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

### 3. read dataframe

#### method 1 - by index [col_name][row_name]

In [10]:
df['eggs']

month
Jan     47
Feb    110
Mar    221
Apr     77
May    132
Jun    205
Name: eggs, dtype: int64

In [11]:
df['eggs']['May']

132

In [13]:
df['spam']

month
Jan    17
Feb    31
Mar    72
Apr    20
May    52
Jun    55
Name: spam, dtype: int64

#### mehtod 2 - by col_attribute and row_index

In [14]:
df.eggs[0]

47

In [15]:
df.salt[1]

50.0

In [21]:
df.salt[:3] #slicing

month
Jan    12.0
Feb    50.0
Mar    89.0
Name: salt, dtype: float64

In [22]:
df.spam[[0, 3, 5]] # fancy

month
Jan    17
Apr    20
Jun    55
Name: spam, dtype: int64

#### method 4 - by using loc

In [23]:
df.loc['Jan', 'eggs']

47

In [25]:
df.loc['Jan':'May', 'eggs':'salt'] # slicing

       eggs  salt
month
Jan      47  12.0
Feb     110  50.0
Mar     221  89.0
Apr      77  87.0
May     132   NaN

In [26]:
df.loc[['Jan', 'May'], ['eggs', 'spam']] # fancy

       eggs  spam
month
Jan      47    17
May     132    52

#### method 4 - by using iloc

In [28]:
df.iloc[1, 1]

50.0

In [29]:
df.iloc[1:3, 1:3] # slicing

       salt  spam
month
Feb    50.0    31
Mar    89.0    72

In [30]:
df.iloc[[1, 3], [0, 2]]

       eggs  spam
month
Feb     110    31
Apr      77    20

### 4. create dataframe from dataframe[[ ]]

In [31]:
df_new = df[['eggs', 'spam']]

In [32]:
df_new

       eggs  spam
month
Jan      47    17
Feb     110    31
Mar     221    72
Apr      77    20
May     132    52
Jun     205    55

### 5. create series (1 col + index) from dataframe[ ]

In [33]:
series = df['eggs']

In [34]:
series

month
Jan     47
Feb    110
Mar    221
Apr     77
May    132
Jun    205
Name: eggs, dtype: int64

## 14.3 Filtering Dataframe

#### import pandas

In [1]:
import pandas as pd

#### read csv data

In [2]:
df = pd.read_csv('C:\\Users\\rs\\Downloads\\01 Data Science Lab Copy\\02 Lab Data\\Python\\pandas_sales.csv', index_col = 'month')

#### observe dataframe

In [3]:
print('***** 01. Observe simple dataframe *****')
print(df)

***** 01. Observe simple dataframe *****
       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

#### filtering data

In [10]:
print('***** 02. Filter data *****')
print('\ncreating a boolean series')
print(df.salt > 60) # creating a boolean series
print('\nfiltering with a boolean series')
print(df[df.salt > 60]) # filtering with a boolean series

***** 02. Filter data *****

creating a boolean series
month
Jan    False
Feb    False
Mar     True
Apr     True
May    False
Jun    False
Name: salt, dtype: bool

filtering with a boolean series
       eggs  salt  spam
month
Mar     221  89.0    72
Apr      77  87.0    20

In [13]:
print('***** 03. Combining filters *****')
print('\nAND Conditions')
print(df[(df.salt >= 50) & (df.eggs < 200)])
print('\nOR Conditions')
print(df[(df.salt > 50) | (df.eggs < 50)])

***** 03. Combining filters *****

AND Conditions
       eggs  salt  spam
month
Feb     110  50.0    31
Apr      77  87.0    20

OR Conditions
       eggs  salt  spam
month
Jan      47  12.0    17
Mar     221  89.0    72
Apr      77  87.0    20
Jun     205  60.0    55

In [15]:
print('***** 04. Dataframes with zeros and NaNs *****')
df1 = df.copy()
print(df1 == df) # note that NaN != NaN

***** 04. Dataframes with zeros and NaNs *****
       eggs   salt  spam
month
Jan    True   True  True
Feb    True   True  True
Mar    True   True  True
Apr    True   True  True
May    True  False  True
Jun    True   True  True

#### add one column to df2

In [17]:
df1['cake'] = [0, 0, 50, 60, 70, 80]

In [18]:
df1

       eggs  salt  spam  cake
month
Jan      47  12.0    17     0
Feb     110  50.0    31     0
Mar     221  89.0    72    50
Apr      77  87.0    20    60
May     132   NaN    52    70
Jun     205  60.0    55    80

In [20]:
print('***** 05. Select columns with all nonzeros *****')
print(df1.loc[:, df1.all()])

***** 05. Select columns with all nonzeros *****
       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [21]:
df2 = df1.copy()

In [23]:
df2['milk'] = [0, 0, 0, 0, 0, 0]

In [24]:
df2

       eggs  salt  spam  cake  milk
month
Jan      47  12.0    17     0     0
Feb     110  50.0    31     0     0
Mar     221  89.0    72    50     0
Apr      77  87.0    20    60     0
May     132   NaN    52    70     0
Jun     205  60.0    55    80     0

In [25]:
print('***** 06. Select columns with any nonzeros *****')
print(df2.loc[:, df2.any()])

***** 06. Select columns with any nonzeros *****
       eggs  salt  spam  cake
month
Jan      47  12.0    17     0
Feb     110  50.0    31     0
Mar     221  89.0    72    50
Apr      77  87.0    20    60
May     132   NaN    52    70
Jun     205  60.0    55    80

In [26]:
print('***** 07. Select columns with any NaN *****')
print(df.loc[:, df.isnull().any()])

***** 07. Select columns with any NaN *****
       salt
month
Jan    12.0
Feb    50.0
Mar    89.0
Apr    87.0
May     NaN
Jun    60.0

In [28]:
print('***** 08. Select columns without any NaN *****')
print(df.loc[:, df.notnull().all()])

***** 08. Select columns without any NaN *****
       eggs  spam
month
Jan      47    17
Feb     110    31
Mar     221    72
Apr      77    20
May     132    52
Jun     205    55

In [30]:
print('***** 09. Drop rows with any NaN *****')
print(df2.dropna(how = 'any'))

***** 09. Drop rows with any NaN *****
       eggs  salt  spam  cake  milk
month
Jan      47  12.0    17     0     0
Feb     110  50.0    31     0     0
Mar     221  89.0    72    50     0
Apr      77  87.0    20    60     0
Jun     205  60.0    55    80     0

In [31]:
print('***** 10. Filtering a column based on another *****')
print(df.eggs[df.salt > 55])

***** 10. Filtering a column based on another *****
month
Mar    221
Apr     77
Jun    205
Name: eggs, dtype: int64

In [32]:
print('***** 11. Modifying a column based on another *****')
df.eggs[df.salt > 55] += 5
df

***** 11. Modifying a column based on another *****

C:\Users\rs\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     226  89.0    72
Apr      82  87.0    20
May     132   NaN    52
Jun     210  60.0    55

## 14.4 Transforming Dataframe

#### import required packages

In [39]:
import pandas as pd
import numpy as np

#### read data

In [34]:
df = pd.read_csv('C:\\Users\\rs\\Downloads\\01 Data Science Lab Copy\\02 Lab Data\\Python\\pandas_sales.csv', index_col = 'month')

#### observe dataframe

In [37]:
print('***** 01. Observe Simple Dataframe *****')
df

***** 01. Observe Simple Dataframe *****

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

#### methods and functions to convert to dozens unit

##### method 1 - dataframe vectorized methods

In [43]:
print('***** 02. Dataframe Vectorized Methods *****')
print(df.floordiv(12)) # convert to dozens unit

***** 02. Dataframe Vectorized Methods *****
       eggs  salt  spam
month
Jan       3   1.0     1
Feb       9   4.0     2
Mar      18   7.0     6
Apr       6   7.0     1
May      11   NaN     4
Jun      17   5.0     4

##### method 2 - numpy vectorized functions

In [40]:
print('***** 03. Numpy Vectorized Functions *****')
print(np.floor_divide(df, 12)) # convert to dozens unit

***** 03. Numpy Vectorized Functions *****
       eggs  salt  spam
month
Jan     3.0   1.0   1.0
Feb     9.0   4.0   2.0
Mar    18.0   7.0   6.0
Apr     6.0   7.0   1.0
May    11.0   NaN   4.0
Jun    17.0   5.0   4.0

C:\Users\rs\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: RuntimeWarning: invalid value encountered in floor_divide

##### method 3 - Plain Python Functions using def

In [41]:
print('***** 04 - 1. Plain Python Functions *****')
def dozens(n):
    return n // 12

print(df.apply(dozens))

***** 04 - 1. Plain Python Functions *****
       eggs  salt  spam
month
Jan       3   1.0     1
Feb       9   4.0     2
Mar      18   7.0     6
Apr       6   7.0     1
May      11   NaN     4
Jun      17   5.0     4

##### method 4 - Plain Python Functions using lambda

In [42]:
print('***** 04 - 2. Plain Python Functions *****')
print(df.apply(lambda n : n //12))

***** 04 - 2. Plain Python Functions *****
       eggs  salt  spam
month
Jan       3   1.0     1
Feb       9   4.0     2
Mar      18   7.0     6
Apr       6   7.0     1
May      11   NaN     4
Jun      17   5.0     4

#### starting transformation

In [45]:
print('***** 05. Starting the transformation *****')
df['dozens_of_eggs'] = df.eggs.floordiv(12)
print(df)

***** 05. Starting the transformation *****
       eggs  salt  spam  dozens_of_eggs
month
Jan      47  12.0    17               3
Feb     110  50.0    31               9
Mar     221  89.0    72              18
Apr      77  87.0    20               6
May     132   NaN    52              11
Jun     205  60.0    55              17

In [46]:
print('***** 06. Dataframe Index *****')
print(df.index)

***** 06. Dataframe Index *****
Index(['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun'], dtype='object', name='month')

In [47]:
print('***** 07 - 1. Working with String values *****')
df.index = df.index.str.upper()
print(df)

***** 07 - 1. Working with String values *****
       eggs  salt  spam  dozens_of_eggs
month
JAN      47  12.0    17               3
FEB     110  50.0    31               9
MAR     221  89.0    72              18
APR      77  87.0    20               6
MAY     132   NaN    52              11
JUN     205  60.0    55              17

In [50]:
print('***** 07 - 2. Working with String values *****')
df.index = df.index.map(str.lower)
print(df)

***** 07 - 2. Working with String values *****
       eggs  salt  spam  dozens_of_eggs
month
jan      47  12.0    17               3
feb     110  50.0    31               9
mar     221  89.0    72              18
apr      77  87.0    20               6
may     132   NaN    52              11
jun     205  60.0    55              17

In [51]:
print('***** 08. Defining Columns using other columns *****')
df['salty_eggs'] = df.salt + df.dozens_of_eggs
print(df)

***** 08. Defining Columns using other columns *****
       eggs  salt  spam  dozens_of_eggs  salty_eggs
month
jan      47  12.0    17               3        15.0
feb     110  50.0    31               9        59.0
mar     221  89.0    72              18       107.0
apr      77  87.0    20               6        93.0
may     132   NaN    52              11         NaN
jun     205  60.0    55              17        77.0